---
kind: type
id: T:Autodesk.Revit.DB.Architecture.Fascia
source: html/04faa348-80ad-397d-60f5-dd931924e294.htm
---
# Autodesk.Revit.DB.Architecture.Fascia

An object that represents a fascia within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class Fascia : HostedSweep
```

## Remarks
This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.